In [74]:
-- connection: postgres://postgres:1234@localhost:5433/pec4

## EJERCICIO 1
>* https://www.postgresqltutorial.com/postgresql-check-constraint/ definir chechk en tablas existentes
>* https://carto.com/help/working-with-data/sql-stored-procedures/ procedimientos almacenados

### PREGUNTA 1
1. En __tb_patient__, quieren evitar la posibilidad de registrar pacientes cuyo __birth_dt__ tenga valor nulo.

In [ ]:
CREATE TABLE tb_patient (
	patient_id INT NOT NULL,
	ehr_number INT,
	name CHARACTER VARYING(50),
	sex  CHARACTER,
	birth_dt DATE, -------------------------------------- ALTERO COLUMNA A NOT NULL
	residence CHARACTER VARYING(100),
	insurance CHARACTER VARYING(50),
	CONSTRAINT PK_tb_patient PRIMARY KEY(patient_id)
	);

In [15]:
SELECT * FROM tb_patient LIMIT 1;

1 row(s) returned.

  patient_id    ehr_number  name    sex    birth_dt    residence         insurance
------------  ------------  ------  -----  ----------  ----------------  -----------
           1          1001  Pep     M      1965-06-14  Carrer Principal  Pública

In [102]:
SELECT * FROM tb_patient WHERE birth_dt is NULL;

0 row(s) returned.

__SIN DISPARADOR, CON RESTRICCION DE COLUMNA__.   
> Podría agregar una restricción NOT NULL a la columna __birth_dt__:  
>
>__`ALTER TABLE nombre_tabla   
>  ALTER COLUMN nombre_columna 
>  SET NOT NULL;`__    
>  
> pero Postgrestsql dice:  
> * "Una restricción NOT NULL es funcionalmente equivalente a crear una restricción de verificación CHECK, pero en PostgreSQL, la creación de una __not-null constraint__  explicitamente es más eficiente". https://www.postgresql.org/docs/9.4/explicit-locking.html  

__CREO ALTER TABLE CON CHECK__

In [10]:
ALTER TABLE tb_patient ADD CONSTRAINT constraint_birth 
CHECK(birth_dt IS NOT NULL) NOT VALID;

ALTER TABLE tb_patient VALIDATE CONSTRAINT constraint_birth;

__COMPRUEBO LA RESTRICCION__

In [124]:
-- NO PERMITE INSERCIÓN --NULL-- EN birth_dt:
INSERT INTO tb_patient (patient_id, ehr_number, name, sex, birth_dt, residence, insurance)
VALUES (888,1001,'PIP','M', null, 'Carrer Principal', 'Pública')

new row for relation "tb_patient" violates check constraint "constraint_birth"
DETAIL:  Failing row contains (888, 1001, PIP, M, null, Carrer Principal, Pública).

### PREGUNTA 2 
2. En __tb_encounter__, quieren asegurarse de que __discharge_dt__ sea siempre mayor o igual que __arrival_dt__.

In [ ]:
CREATE TABLE tb_encounter (
	encounter_id INT NOT NULL,
	patient_id INT NOT NULL,
	encounter_type CHARACTER VARYING(50) NOT NULL,
	arrival_dt TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,  --<---- arrival_d
	discharge_dt TIMESTAMP, ------------------------------------<---- discharge_dt
	med_service_id INT NOT NULL,
	CONSTRAINT PK_tb_encounter PRIMARY KEY(encounter_id),
	CONSTRAINT FK_encounter_patient FOREIGN KEY (patient_id) REFERENCES tb_patient(patient_id),
	CONSTRAINT FK_encounter_med_service FOREIGN KEY (med_service_id) REFERENCES tb_medical_services(med_service_id)
	);

In [100]:
SELECT * FROM tb_encounter LIMIT 1;

1 row(s) returned.

  encounter_id    patient_id  encounter_type    arrival_dt           discharge_dt           med_service_id
--------------  ------------  ----------------  -------------------  -------------------  ----------------
         65091            31  Consulta Externa  2016-04-12 08:59:00  2016-04-12 22:50:00                 1

__SIN DISPARADOR, CREO ALTER TABLE__

In [99]:
ALTER TABLE clinical.tb_encounter ADD CONSTRAINT check_dates2
CHECK(arrival_dt <= discharge_dt);

ALTER TABLE clinical.tb_encounter VALIDATE CONSTRAINT check_dates;

__COMPRUEBO INSERTANDO VALORES__

In [101]:
INSERT INTO tb_encounter (encounter_id,patient_id,encounter_type,arrival_dt,discharge_dt,med_service_id)
VALUES (888,1001,'Consulta Externa', '2016-04-12 08:59:00', '2015-04-12 08:59:00', 1)

new row for relation "tb_encounter" violates check constraint "check_dates"
DETAIL:  Failing row contains (888, 1001, Consulta Externa, 2016-04-12 08:59:00, 2015-04-12 08:59:00, 1).

### PREGUNTA 3
3. En __tb_orders__, quieren evitar que los valores insertados en __created_dt__ puedan ser modificados.

In [189]:
SELECT * FROM clinical.tb_orders LIMIT 1;

1 row(s) returned.

  order_id    order_code    encounter_id  status      created_dt           status_dt              created_by_user
----------  ------------  --------------  ----------  -------------------  -------------------  -----------------
       100          2084          458151  Solicitada  2009-06-16 09:12:00  2011-06-08 14:08:00                  1

__CREO DISPARADOR__

In [193]:
CREATE OR REPLACE FUNCTION stop_change_on_created_dt()
RETURNS trigger AS
$$
BEGIN
  IF NEW.created_dt <> OLD.created_dt THEN
      RAISE EXCEPTION 'the inserted values cannot be modified';
  END IF;
  RETURN NEW;
END;
$$ LANGUAGE plpgsql;

In [17]:
--DROP FUNCTION stop_change_on_created_dt() CASCADE;

In [191]:
CREATE TRIGGER avoid_created_dt_changes
BEFORE UPDATE ON clinical.tb_orders FOR EACH ROW
EXECUTE PROCEDURE stop_change_on_created_dt();

In [25]:
--DROP TRIGGER IF EXISTS avoid_created_dt_changes ON clinical.tb_orders

In [192]:
select event_object_schema as table_schema,
       event_object_table as table_name,
       trigger_schema,
       trigger_name,
       string_agg(event_manipulation, ',') as event,
       action_timing as activation,
       action_condition as condition,
       action_statement as definition
from information_schema.triggers
group by 1,2,3,4,6,7,8
order by table_schema,
         table_name;

1 row(s) returned.

table_schema    table_name    trigger_schema    trigger_name              event    activation    condition    definition
--------------  ------------  ----------------  ------------------------  -------  ------------  -----------  --------------------------------------------
clinical        tb_orders     clinical          avoid_created_dt_changes  UPDATE   BEFORE                     EXECUTE FUNCTION stop_change_on_created_dt()

__INSERTO FILA DE PRUEBA__

In [201]:
INSERT INTO clinical.tb_orders (order_id,order_code,encounter_id,status,created_dt,status_dt,created_by_user)
VALUES (997,2084,458151,'Solicitada', '2016-04-12 08:59:00', '2015-04-12 08:59:00', 1)

duplicate key value violates unique constraint "pk_tb_orders"
DETAIL:  Key (order_id)=(997) already exists.

In [205]:
UPDATE clinical.tb_orders SET created_dt='2016-04-12 08:59:01' where order_id =997;

the inserted values cannot be modified
CONTEXT:  PL/pgSQL function stop_change_on_created_dt() line 4 at RAISE

__INTENTO MODIFICAR COLUMNA FUERA DE RESTRICCION created_by_user__

In [33]:
-- NO MODIFICA created_dt
UPDATE clinical.tb_orders SET created_dt='2013-04-12 08:59:00' WHERE order_id=666;

In [29]:
SELECT * FROM clinical.tb_orders WHERE order_id=777;

1 row(s) returned.

  order_id    order_code    encounter_id  status      created_dt           status_dt              created_by_user
----------  ------------  --------------  ----------  -------------------  -------------------  -----------------
       777          1001        45815199  Solicitada  2013-04-12 08:59:00  2015-04-12 08:59:00                  1

__HAGO LO MISMO CON REVOKE AND GRANT__

In [30]:
REVOKE UPDATE ON clinical.tb_orders FROM current_user;

In [31]:
GRANT UPDATE (order_id, order_code, encounter_id, status, status_dt, created_by_user) 
ON clinical.tb_orders TO current_user;

In [36]:
CREATE TYPE clinical.date_output AS (years INTEGER);

In [40]:
CREATE OR REPLACE FUNCTION summary_orders()
RETURNS SETOF clinical.date_output AS 
$$
DECLARE
	year_desc_per clinical.date_output;
	years INTEGER;
	code INTEGER;
	total_year INTEGER;
	total_code INTEGER;
	order_desc VARCHAR(50);
	--percentage DECIMAL(4,2);
BEGIN
	total_year = 0;
	total_code = 0;
	--percentage = 0;
	FOR years IN SELECT DISTINCT extract('year' from o.created_dt) 
			     FROM clinical.tb_orders o 
			     WHERE o.status = 'Realizada' 
			     ORDER BY 1 ASC LOOP
		FOR code IN SELECT DISTINCT o.order_code 
					FROM clinical.tb_orders o 
					WHERE extract('year' from o.created_dt) = years AND o.status = 'Realizada' 
					ORDER BY 1 ASC LOOP
						total_year = (SELECT * FROM yearly_orders(years));
						total_code = (SELECT * FROM catalog_yearly_orders(years, code));
						--percentage = (total_code*100)/total_year;
						order_desc = (SELECT  oc.order_desc 
									  FROM clinical.tb_orders_catalog oc 
									  WHERE oc.order_code = code);
						RETURN NEXT total_year;
						--RETURN NEXT (years, order_desc , percentage);
		END LOOP;
	END LOOP;
END;
$$LANGUAGE plpgsql;

In [41]:
SELECT * FROM summary_orders();

21 row(s) returned.

  years
-------
      2
      2
      7
      7
    249
    249
    249
    249
    249
    249
    249
    249
     17
     17
     17
      3
      3
      3
      6
      6
      6

In [60]:
DROP TYPE clinical.date_output CASCADE;

NOTICE:  drop cascades to function summary_orders()

In [61]:
--DROP TYPE clinical.date_output
CREATE TYPE clinical.date_output AS (years INTEGER, total_year INTEGER, total_code INTEGER, code INTEGER);

In [62]:
CREATE OR REPLACE FUNCTION summary_orders()
RETURNS SETOF clinical.date_output AS 
$$
DECLARE
	year_desc_per clinical.date_output;
	years INTEGER;
	code INTEGER;
	total_year INTEGER;
	total_code INTEGER;
	order_desc VARCHAR(50);
	--percentage DECIMAL(4,2);
BEGIN
	total_year = 0;
	total_code = 0;
	--percentage = 0;
	FOR years IN SELECT DISTINCT extract('year' from o.created_dt) 
			     FROM clinical.tb_orders o 
			     WHERE o.status = 'Realizada' 
			     ORDER BY 1 ASC LOOP
		FOR code IN SELECT DISTINCT o.order_code 
					FROM clinical.tb_orders o 
					WHERE extract('year' from o.created_dt) = years AND o.status = 'Realizada' 
					ORDER BY 1 ASC LOOP
						total_year = (SELECT * FROM yearly_orders(years));
						total_code = (SELECT * FROM catalog_yearly_orders(years, code));
						--percentage = (total_code*100)/total_year;
						order_desc = (SELECT  oc.order_desc 
									  FROM clinical.tb_orders_catalog oc 
									  WHERE oc.order_code = code);
						RETURN NEXT (years, total_year, total_code, code);
						--RETURN NEXT (years, order_desc , percentage);
		END LOOP;
	END LOOP;
END;
$$LANGUAGE plpgsql;

In [ ]:
7	4
7	5
250	1
250	17
250	2
250	84
250	170
250	3
250	1
250	1
17	1
17	8
17	13
3	1
3	1
3	1
6	2
6	2
6	2

In [ ]:
2009	0	4
2009	0	1
2009	0	2
2009	0	3
2009	0	3
2009	0	1
2010	0	1
2010	0	4
2010	0	5
2015	7	4
2015	7	5
2016	250	1
2016	250	17
2016	250	2
2016	250	84
2016	250	170
2016	250	3
2016	250	1
2016	250	1
2017	17	1
2017	17	8
2017	17	13
2018	3	1
2018	3	1
2018	3	1
2019	6	2
2019	6	2
2019	6	2

In [63]:
SELECT * FROM summary_orders();

21 row(s) returned.

  years    total_year    total_code    code
-------  ------------  ------------  ------
   2009             2             2    2084
   2009             2             3    2216
   2015             7             4    2144
   2015             7             5    2216
   2016           249             1    1369
   2016           249            17    2084
   2016           249             2    2114
   2016           249            84    2144
   2016           249           170    2216
   2016           249             3    3730
   2016           249             1    6707
   2016           249             1    7636
   2017            17             1    2084
   2017            17             8    2144
   2017            17            13    2216
   2018             3             1    2114
   2018             3             1    2144
   2018             3             1    2216
   2019             6             2    2114
   2019             6             2    2144
   2019             6             2    2216

__PEC4__

In [ ]:
-- connection: postgres://postgres:1234@localhost:5433/pec4

__PREGUNTA 2.a__

In [114]:
-----------------------------------
-- Pregunta 2.a
-----------------------------------

CREATE OR REPLACE FUNCTION catalog_yearly_orders (
    years integer, 
    codes clinical.tb_orders.order_code%type)
RETURNS integer AS 
$$
DECLARE
    año integer;
    orden integer;
    suma_prestaciones integer;
BEGIN
    suma_prestaciones = 0;
    FOR año, orden 
        IN SELECT extract(year from o.created_dt), o.order_code 
           FROM clinical.tb_orders o
           WHERE extract(year from o.created_dt)=years AND 
                 o.order_code=codes AND
                 o.status='Realizada'  LOOP 
        suma_prestaciones = suma_prestaciones + 1;
    END LOOP;
    RETURN suma_prestaciones;
END;
$$LANGUAGE plpgsql;

NOTICE:  type reference clinical.tb_orders.order_code%TYPE converted to integer

In [124]:
SELECT * FROM catalog_yearly_orders(2015,2144);

1 row(s) returned.

  catalog_yearly_orders
-----------------------
                      3

In [123]:
SELECT extract(year from o.created_dt), oc.order_desc, o.order_code, COUNT(o.order_code)
FROM clinical.tb_orders o, clinical.tb_orders_catalog oc 
WHERE o.status= 'Realizada' AND 
      oc.order_code=o.order_code
GROUP BY extract(year from o.created_dt), o.order_code, oc.order_desc 
ORDER BY 1 asc

19 row(s) returned.

  date_part  order_desc                                order_code    count
-----------  --------------------------------------  ------------  -------
       2015  Creatinina..Srm                                 2144        3
       2015  Hemograma..San                                  2216        4
       2016  Holter de ritmo cardiaco                        1369        1
       2016  Calcio..Srm                                     2084       15
       2016  Colesterol de HDL..Srm                          2114        2
       2016  Creatinina..Srm                                 2144       77
       2016  Hemograma..San                                  2216      150
       2016  Trousseau                                       3730        3
       2016  MIN Ecocardiografía transtorácica               6707        1
       2016  Consulta Sucesiva Anticoagulación Oral          7636        1
       2017  Calcio..Srm                                     2084        1
       2017  Creatinina..Srm                                 2144        6
       2017  Hemograma..San                                  2216       10
       2018  Colesterol de HDL..Srm                          2114        1
       2018  Creatinina..Srm                                 2144        1
       2018  Hemograma..San                                  2216        1
       2019  Colesterol de HDL..Srm                          2114        2
       2019  Creatinina..Srm                                 2144        2
       2019  Hemograma..San                                  2216        2

__PREGUNTA 2.b__

In [170]:
-----------------------------------
-- Pregunta 2.b
-----------------------------------

CREATE OR REPLACE FUNCTION yearly_orders(
	year INTEGER)
RETURNS integer AS
$$
DECLARE
    total_prestaciones_realizadas integer;
BEGIN
    total_prestaciones_realizadas = 0;
    SELECT COUNT(o.order_code) INTO total_prestaciones_realizadas
    FROM clinical.tb_orders o
    WHERE o.status='Realizada' AND extract(year from o.created_dt)=year
    GROUP BY extract(year from o.created_dt) ORDER BY 1 ASC;
    RETURN total_prestaciones_realizadas;
END;
$$LANGUAGE plpgsql;

In [174]:
SELECT * FROM yearly_orders(2019);

1 row(s) returned.

  yearly_orders
---------------
              6

In [161]:
SELECT extract(year from o.created_dt), COUNT(o.order_code)
FROM clinical.tb_orders o
WHERE o.status='Realizada'
GROUP BY extract(year from o.created_dt) ORDER BY 1 ASC

5 row(s) returned.

  date_part    count
-----------  -------
       2015        7
       2016      250
       2017       17
       2018        3
       2019        6

In [167]:
SELECT COUNT(o.order_code)
FROM clinical.tb_orders o
WHERE o.status='Realizada' AND extract(year from o.created_dt)=2019
GROUP BY extract(year from o.created_dt) ORDER BY 1 ASC

1 row(s) returned.

  count
-------
      6

__PREGUNTA 2.c__

In [179]:
DROP TYPE clinical.date_output CASCADE;

NOTICE:  drop cascades to function summary_orders()

In [180]:
CREATE TYPE clinical.date_output AS (years INTEGER, 
                                     order_desc VARCHAR(50), 
                                     percentage DECIMAL(4,2));

In [185]:
DROP FUNCTION summary_orders();

In [186]:
-----------------------------------
-- Pregunta 2.c
-----------------------------------
CREATE OR REPLACE FUNCTION summary_orders()
RETURNS SETOF clinical.date_output AS 
$$
DECLARE
	year_desc_per clinical.date_output;
	years INTEGER;
	code INTEGER;
	total_year NUMERIC;
	total_code NUMERIC;
	order_desc VARCHAR(50);
	percentage DECIMAL(4,2);
BEGIN
	total_year = 0;
	total_code = 0;
	percentage = 0;
	FOR years IN SELECT DISTINCT extract('year' from o.created_dt) 
			     FROM clinical.tb_orders o  
			     ORDER BY 1 ASC LOOP
		FOR code IN SELECT DISTINCT o.order_code 
					FROM clinical.tb_orders o 
					WHERE extract('year' from o.created_dt) = years AND o.status = 'Realizada' 
					ORDER BY 1 ASC LOOP
						total_year = (SELECT * FROM yearly_orders(years));
						total_code = (SELECT * FROM catalog_yearly_orders(years, code));
						percentage = (total_code*100)/total_year;
						order_desc = (SELECT  oc.order_desc 
									  FROM clinical.tb_orders_catalog oc 
									  WHERE oc.order_code = code);
						RETURN NEXT (years, order_desc , percentage);
		END LOOP;
	END LOOP;
END;
$$LANGUAGE plpgsql;

In [187]:
SELECT * FROM summary_orders();

19 row(s) returned.

  years  order_desc                                percentage
-------  --------------------------------------  ------------
   2015  Creatinina..Srm                                42.86
   2015  Hemograma..San                                 57.14
   2016  Holter de ritmo cardiaco                        0.4
   2016  Calcio..Srm                                     6
   2016  Colesterol de HDL..Srm                          0.8
   2016  Creatinina..Srm                                30.8
   2016  Hemograma..San                                 60
   2016  Trousseau                                       1.2
   2016  MIN Ecocardiografía transtorácica               0.4
   2016  Consulta Sucesiva Anticoagulación Oral          0.4
   2017  Calcio..Srm                                     5.88
   2017  Creatinina..Srm                                35.29
   2017  Hemograma..San                                 58.82
   2018  Colesterol de HDL..Srm                         33.33
   2018  Creatinina..Srm                                33.33
   2018  Hemograma..San                                 33.33
   2019  Colesterol de HDL..Srm                         33.33
   2019  Creatinina..Srm                                33.33
   2019  Hemograma..San                                 33.33

__COMBINACINES__

In [80]:
--DROP TYPE clinical.date_output
CREATE TYPE clinical.date_output2 AS (years INTEGER, total_year INTEGER, total_code INTEGER, code INTEGER);

In [82]:
--DROP FUNCTION summary_orders()

In [83]:
CREATE OR REPLACE FUNCTION summary_orders()
RETURNS SETOF clinical.date_output2 AS 
$$
DECLARE
	year_desc_per clinical.date_output2;
	years INTEGER;
	code INTEGER;
	total_year INTEGER;
	total_code INTEGER;
	order_desc VARCHAR(50);
	--percentage DECIMAL(4,2);
BEGIN
	total_year = 0;
	total_code = 0;
	--percentage = 0;
	FOR years IN SELECT DISTINCT extract('year' from o.created_dt) 
			     FROM clinical.tb_orders o 
			     WHERE o.status = 'Realizada' 
			     ORDER BY 1 ASC LOOP
		FOR code IN SELECT DISTINCT o.order_code 
					FROM clinical.tb_orders o 
					WHERE extract('year' from o.created_dt) = years AND o.status = 'Realizada' 
					ORDER BY 1 ASC LOOP
						total_year = (SELECT * FROM yearly_orders(years));
						total_code = (SELECT * FROM catalog_yearly_orders(years, code));
						--percentage = (total_code*100)/total_year;
						order_desc = (SELECT  oc.order_desc 
									  FROM clinical.tb_orders_catalog oc 
									  WHERE oc.order_code = code);
						RETURN NEXT (years, total_year, total_code, code);
						--RETURN NEXT (years, order_desc , percentage);
		END LOOP;
	END LOOP;
END;
$$LANGUAGE plpgsql;

In [85]:
SELECT * FROM summary_orders();

19 row(s) returned.

  years    total_year    total_code    code
-------  ------------  ------------  ------
   2015             7             4    2144
   2015             7             5    2216
   2016           250             1    1369
   2016           250            17    2084
   2016           250             2    2114
   2016           250            84    2144
   2016           250           170    2216
   2016           250             3    3730
   2016           250             1    6707
   2016           250             1    7636
   2017            17             1    2084
   2017            17             8    2144
   2017            17            13    2216
   2018             3             1    2114
   2018             3             1    2144
   2018             3             1    2216
   2019             6             2    2114
   2019             6             2    2144
   2019             6             2    2216